# Part 4 Questions

In [1]:
import pandas as pd

In [2]:
restaurant = pd.read_csv('Restaurant.csv')
reviews = pd.read_csv('Review.csv')

In [3]:
restaurant.head(2)

,Business Id,Business Name,Type,Latitude,Longitude,Ratings,Review_Counts,Price,Zipcode,Delivery
0,dh5r9-SbN8xJ76XvnayWLQ,Giano Restaurant,Italian,40.726226,-73.984057,4.5,614,$$,10009,True
1,Vs8kQ4R381y27AH018gLpg,Supper,Italian,40.722900,-73.985270,4.0,1315,$$,10009,True

In [4]:
reviews.head(2)

,Business Id,Reviewer Name,Rating,Text,Time Created
0,dh5r9-SbN8xJ76XvnayWLQ,Ash C.,5,Discovered this place during the pandemic and ...,2021-02-08
1,dh5r9-SbN8xJ76XvnayWLQ,Grey M.,5,We enjoyed a COVID dinner here. We dined in a...,2021-01-23

## Top 5 most reviewed businesses

In [5]:
top_5 = restaurant[['Business Name', 'Review_Counts']].sort_values(by='Review_Counts', ascending = False).head()
top_5

                Business Name  Review_Counts
41            Eataly Flatiron           5652
683                  Buddakan           4027
135                     Becco           2845
586  Vanessa's Dumpling House           2664
17                        Uva           2420

## Highest rating and number of Businesses with that rating

In [6]:
business_reviews = restaurant.merge(reviews, how = 'outer', on = 'Business Id' )

In [7]:
business_reviews.head(2)

,Business Id,Business Name,Type,Latitude,Longitude,Ratings,Review_Counts,Price,Zipcode,Delivery,Reviewer Name,Rating,Text,Time Created
0,dh5r9-SbN8xJ76XvnayWLQ,Giano Restaurant,Italian,40.726226,-73.984057,4.5,614,$$,10009,True,Ash C.,5,Discovered this place during the pandemic and ...,2021-02-08
1,dh5r9-SbN8xJ76XvnayWLQ,Giano Restaurant,Italian,40.726226,-73.984057,4.5,614,$$,10009,True,Grey M.,5,We enjoyed a COVID dinner here. We dined in a...,2021-01-23

In [8]:
business_reviews.groupby(by='Ratings')['Business Id'].aggregate(['count']).sort_values(by='Ratings', ascending = False).head(1)

         count
Ratings
5.0         18

## Businesses greater than or equal to 4.5 rating

In [9]:
restaurant[restaurant['Ratings'] >= 4.5].shape[0]/restaurant.shape[0]*100

15.384615384615385

## Businesses with rating less than 3

In [10]:
restaurant[restaurant['Ratings'] < 3].shape[0]/restaurant.shape[0]*100

1.7751479289940828

## Percent of businesses with $

In [11]:
restaurant['Price'].value_counts(normalize = True)*100

$$      50.197239
$       32.642998
$$$     15.581854
$$$$     1.577909
Name: Price, dtype: float64

## Text for Most Reviewed Business

In [12]:
restaurant.head(5).sort_values(by = 'Review_Counts', ascending = False)

,Business Id,Business Name,Type,Latitude,Longitude,Ratings,Review_Counts,Price,Zipcode,Delivery
2,WG639VkTjmK5dzydd1BBJA,Rubirosa,Italian,40.722766,-73.996233,4.5,2323,$$,10012,True
3,rp8S7scxOkVVeG7dNneMGQ,L'Artusi,Italian,40.733720,-74.005130,4.5,1879,$$$,10014,True
4,yZJbealagfujEkgesAl2hA,Lupa,Italian,40.727600,-74.000045,4.0,1556,$$$,10012,True
1,Vs8kQ4R381y27AH018gLpg,Supper,Italian,40.722900,-73.985270,4.0,1315,$$,10009,True
0,dh5r9-SbN8xJ76XvnayWLQ,Giano Restaurant,Italian,40.726226,-73.984057,4.5,614,$$,10009,True

In [13]:
business_reviews[business_reviews['Business Id'] == 'WG639VkTjmK5dzydd1BBJA']['Text']

6    The key is to eat this pizza FRESH, piping hot...
7    I always want to try Rubirosa pizza. But how c...
8    Easily one of the best places in the city to s...
Name: Text, dtype: object

## Highest rated business and most recent review

In [14]:
restaurant.head(5).sort_values(by = ['Ratings','Review_Counts'], ascending = False)

,Business Id,Business Name,Type,Latitude,Longitude,Ratings,Review_Counts,Price,Zipcode,Delivery
2,WG639VkTjmK5dzydd1BBJA,Rubirosa,Italian,40.722766,-73.996233,4.5,2323,$$,10012,True
3,rp8S7scxOkVVeG7dNneMGQ,L'Artusi,Italian,40.733720,-74.005130,4.5,1879,$$$,10014,True
0,dh5r9-SbN8xJ76XvnayWLQ,Giano Restaurant,Italian,40.726226,-73.984057,4.5,614,$$,10009,True
4,yZJbealagfujEkgesAl2hA,Lupa,Italian,40.727600,-74.000045,4.0,1556,$$$,10012,True
1,Vs8kQ4R381y27AH018gLpg,Supper,Italian,40.722900,-73.985270,4.0,1315,$$,10009,True

In [15]:
business_reviews[business_reviews['Business Id'] == 'WG639VkTjmK5dzydd1BBJA'][['Text', 'Time Created']].sort_values('Time Created', ascending = False).head(1)['Text']

6    The key is to eat this pizza FRESH, piping hot...
Name: Text, dtype: object

## Lowest rated business and most recent review

In [16]:
restaurant.head(5).sort_values(by = ['Ratings', 'Review_Counts'], ascending = True)

,Business Id,Business Name,Type,Latitude,Longitude,Ratings,Review_Counts,Price,Zipcode,Delivery
1,Vs8kQ4R381y27AH018gLpg,Supper,Italian,40.722900,-73.985270,4.0,1315,$$,10009,True
4,yZJbealagfujEkgesAl2hA,Lupa,Italian,40.727600,-74.000045,4.0,1556,$$$,10012,True
0,dh5r9-SbN8xJ76XvnayWLQ,Giano Restaurant,Italian,40.726226,-73.984057,4.5,614,$$,10009,True
3,rp8S7scxOkVVeG7dNneMGQ,L'Artusi,Italian,40.733720,-74.005130,4.5,1879,$$$,10014,True
2,WG639VkTjmK5dzydd1BBJA,Rubirosa,Italian,40.722766,-73.996233,4.5,2323,$$,10012,True

In [17]:
business_reviews[business_reviews['Business Id'] == 'Vs8kQ4R381y27AH018gLpg'][['Text', 'Time Created']].sort_values('Time Created', ascending = False).head(1)['Text']

5    Every single dish, every single time, always d...
Name: Text, dtype: object